FemDesign.Results.BarStress
FemDesign "Bars, Stresses" result

FemDesign.Results.BarStress.Id
Bar name identifier

FemDesign.Results.BarStress.Pos
Position Result
The value is the relative distance from the
starting point of the bar

FemDesign.Results.BarStress.SigmaXiMax
Maximum Normal Tension

FemDesign.Results.BarStress.SigmaXiMin
Minimum Normal Tension

FemDesign.Results.BarStress.SigmaVM
Von Mises Stress

FemDesign.Results.BarStress.CaseIdentifier
Load case or combination name

FemDesign.Results.BarStress.DeconstructBarStress(System.Collections.Generic.List{FemDesign.Results.BarStress},System.String)
The method has been created for returning the value for Grasshopper and Dynamo.
The method can still be use for C# users.